Autodesk.Revit.DB.BRepBuilder.IsPermittedSurfaceType(Autodesk.Revit.DB.Surface)
A validator function that checks whether the surface object is of type supported as face surface by BRepBuilder.
Remarks:
The allowed surface types are ConicalSurface, CylindricalSurface, Plane, RevolvedSurface, RuledSurface, and HermiteSurface.
surface:
Surface object intended to be used as a face surface.
Returns:
True if a surface of this type may be used as a face surface, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.BRepBuilder.GetResult(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.BRepBuilderPersistentIds)
Get the Autodesk.Revit.DB.ExternallyTaggedBRep built by this BRepBuilder. This will clear the built geometry stored in the BRepBuilder.
This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
externalId:
The external Id of the GeometryObject built by this BRepBuilder.
brepPersistentIds:
An object storing the relationship between ExternalGeometryIds and BRepBuilderGeometryIds.
Returns:
The Autodesk.Revit.DB.ExternallyTaggedBRep built by this BRepBuilder.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one BRepBuilderGeometryId in the supplied BRepBuilderPersistentIds map could not be found in this BRepBuilder object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object hasn't completed building data or was unsuccessful building it. Built Geometry is unavailable.
In order to access the built Geometry, Finish() must be called first. That will set the state to completed.
Since:
2022

Autodesk.Revit.DB.BRepBuilder.GetResult
Get the Autodesk.Revit.DB.Solid built by this BRepBuilder. This will clear the built geometry stored in the BRepBuilder.
This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
Returns:
The Autodesk.Revit.DB.Solid built by this BRepBuilder.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object hasn't completed building data or was unsuccessful building it. Built Geometry is unavailable.
In order to access the built Geometry, Finish() must be called first. That will set the state to completed.
Since:
2016

Autodesk.Revit.DB.BRepBuilder.Finish
Complete construction of the geometry. The geometry will be validated and, if valid, stored in this BRepBuilder. Otherwise it will be deleted.
Remarks:
If this function returned anything but BRepBuilderOutcome.Success, this BrepBuilder object should be discarded.
An attempt to retrieve the built b-rep via GetBRep() will cause an exception to be thrown.
Returns:
BRepBuilderOutcome.Success if successful, BRepBuilderOutcome.Failure otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error.
Consult the State property of the BRepBuilder object for more details.
-or-
BRep doesn't have enough faces.
-or-
FinishFace() must be called on all the faces of the BRepBuilder.
Since:
2016

Autodesk.Revit.DB.BRepBuilder.AddCoEdge(Autodesk.Revit.DB.BRepBuilderGeometryId,Autodesk.Revit.DB.BRepBuilderGeometryId,System.Boolean)
Add a co-edge associated to a previously added edge. A co-edge represents the use of an edge on one
of the edge's faces. BrepBuilder allows at most two faces per edge, hence at most two co-edges per edge,
and the co-edges must have opposite bCoEdgeIsReversed flags. The co-edges in a loop must be added in the
order in which they occur in the loop (i.e., in their topological order).
loopId:
Id of the loop containing the new co-edge.
edgeId:
Id of the co-edge's edge, previously created by a call to addEdge().
bCoEdgeIsReversed:
True if the co-edge's topological direction in its face is opposite to the edge's parametric direction, false otherwise.
The topological directions of the co-edges in a loop must be consistent with the direction in which the loop co-edges
appear in the loop, and the loop orientations so defined must follow the convention that outer loops are oriented
counter-clockwise and inner loops are oriented clockwise, with respect to the face's orientation.
Returns:
Id of the edge, to be used in calls to other BRepBuilder methods such as AddCoEdge().
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied loop id doesn't correspond to a loop stored in this BRepBuilder object.
-or-
The supplied edge id doesn't correspond to an edge stored in this BRepBuilder object.
-or-
FinishLoop() has already been called on loopId.
-or-
The edge already has two coedges associated to it.
-or-
Inconsistent use of the edge by co-edges is detected: both co-edges have the same bCoedgeIsReversed parameter.
-or-
The edge has already been added to this face.
-or-
There is a gap between this co-edge and the previous co-edge in the loop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error.
Consult the State property of the BRepBuilder object for more details.
Since:
2016